HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMtu_bf.h
/** \\brief  Mask for Ifx_MTU_ACCEN0_Bits.EN27 */
#define IFX_MTU_ACCEN0_EN27_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_ACCEN0_Bits.EN27 */
#define IFX_MTU_ACCEN0_EN27_OFF (27)

/** \\brief  Length for Ifx_MTU_ACCEN0_Bits.EN28 */
#define IFX_MTU_ACCEN0_EN28_LEN (1)

/** \\brief  Mask for Ifx_MTU_ACCEN0_Bits.EN28 */
#define IFX_MTU_ACCEN0_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_ACCEN0_Bits.EN28 */
#define IFX_MTU_ACCEN0_EN28_OFF (28)

/** \\brief  Length for Ifx_MTU_ACCEN0_Bits.EN29 */
#define IFX_MTU_ACCEN0_EN29_LEN (1)

/** \\brief  Mask for Ifx_MTU_ACCEN0_Bits.EN29 */
#define IFX_MTU_ACCEN0_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_ACCEN0_Bits.EN29 */
#define IFX_MTU_ACCEN0_EN29_OFF (29)

/** \\brief  Length for Ifx_MTU_ACCEN0_Bits.EN2 */
#define IFX_MTU_ACCEN0_EN2_LEN (1)

/** \\brief  Mask for Ifx_MTU_ACCEN0_Bits.EN2 */
#define IFX_MTU_ACCEN0_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_ACCEN0_Bits.EN2 */
#define IFX_MTU_ACCEN0_EN2_OFF (2)

/** \\brief  Length for Ifx_MTU_ACCEN0_Bits.EN30 */
#define IFX_MTU_ACCEN0_EN30_LEN (1)

/** \\brief  Mask for Ifx_MTU_ACCEN0_Bits.EN30 */
#define IFX_MTU_ACCEN0_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_ACCEN0_Bits.EN30 */
#define IFX_MTU_ACCEN0_EN30_OFF (30)

/** \\brief  Length for Ifx_MTU_ACCEN0_Bits.EN31 */
#define IFX_MTU_ACCEN0_EN31_LEN (1)

/** \\brief  Mask for Ifx_MTU_ACCEN0_Bits.EN31 */
#define IFX_MTU_ACCEN0_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_ACCEN0_Bits.EN31 */
#define IFX_MTU_ACCEN0_EN31_OFF (31)

/** \\brief  Length for Ifx_MTU_ACCEN0_Bits.EN3 */
#define IFX_MTU_ACCEN0_EN3_LEN (1)

/** \\brief  Mask for Ifx_MTU_ACCEN0_Bits.EN3 */
#define IFX_MTU_ACCEN0_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_ACCEN0_Bits.EN3 */
#define IFX_MTU_ACCEN0_EN3_OFF (3)

/** \\brief  Length for Ifx_MTU_ACCEN0_Bits.EN4 */
#define IFX_MTU_ACCEN0_EN4_LEN (1)

/** \\brief  Mask for Ifx_MTU_ACCEN0_Bits.EN4 */
#define IFX_MTU_ACCEN0_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_ACCEN0_Bits.EN4 */
#define IFX_MTU_ACCEN0_EN4_OFF (4)

/** \\brief  Length for Ifx_MTU_ACCEN0_Bits.EN5 */
#define IFX_MTU_ACCEN0_EN5_LEN (1)

/** \\brief  Mask for Ifx_MTU_ACCEN0_Bits.EN5 */
#define IFX_MTU_ACCEN0_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_ACCEN0_Bits.EN5 */
#define IFX_MTU_ACCEN0_EN5_OFF (5)

/** \\brief  Length for Ifx_MTU_ACCEN0_Bits.EN6 */
#define IFX_MTU_ACCEN0_EN6_LEN (1)

/** \\brief  Mask for Ifx_MTU_ACCEN0_Bits.EN6 */
#define IFX_MTU_ACCEN0_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_ACCEN0_Bits.EN6 */
#define IFX_MTU_ACCEN0_EN6_OFF (6)

/** \\brief  Length for Ifx_MTU_ACCEN0_Bits.EN7 */
#define IFX_MTU_ACCEN0_EN7_LEN (1)

/** \\brief  Mask for Ifx_MTU_ACCEN0_Bits.EN7 */
#define IFX_MTU_ACCEN0_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_ACCEN0_Bits.EN7 */
#define IFX_MTU_ACCEN0_EN7_OFF (7)

/** \\brief  Length for Ifx_MTU_ACCEN0_Bits.EN8 */
#define IFX_MTU_ACCEN0_EN8_LEN (1)

/** \\brief  Mask for Ifx_MTU_ACCEN0_Bits.EN8 */
#define IFX_MTU_ACCEN0_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_ACCEN0_Bits.EN8 */
#define IFX_MTU_ACCEN0_EN8_OFF (8)

/** \\brief  Length for Ifx_MTU_ACCEN0_Bits.EN9 */
#define IFX_MTU_ACCEN0_EN9_LEN (1)

/** \\brief  Mask for Ifx_MTU_ACCEN0_Bits.EN9 */
#define IFX_MTU_ACCEN0_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_ACCEN0_Bits.EN9 */
#define IFX_MTU_ACCEN0_EN9_OFF (9)

/** \\brief  Length for Ifx_MTU_ID_Bits.MODNUMBER */
#define IFX_MTU_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_MTU_ID_Bits.MODNUMBER */
#define IFX_MTU_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_MTU_ID_Bits.MODNUMBER */
#define IFX_MTU_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_MTU_ID_Bits.MODREV */
#define IFX_MTU_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_MTU_ID_Bits.MODREV */
#define IFX_MTU_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_MTU_ID_Bits.MODREV */
#define IFX_MTU_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_MTU_ID_Bits.MODTYPE */
#define IFX_MTU_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_MTU_ID_Bits.MODTYPE */
#define IFX_MTU_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_MTU_ID_Bits.MODTYPE */
#define IFX_MTU_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM0AIU */
#define IFX_MTU_MEMSTAT0_MEM0AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM0AIU */
#define IFX_MTU_MEMSTAT0_MEM0AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM0AIU */
#define IFX_MTU_MEMSTAT0_MEM0AIU_OFF (0)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM10AIU */
#define IFX_MTU_MEMSTAT0_MEM10AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM10AIU */
#define IFX_MTU_MEMSTAT0_MEM10AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM10AIU */
#define IFX_MTU_MEMSTAT0_MEM10AIU_OFF (10)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM11AIU */
#define IFX_MTU_MEMSTAT0_MEM11AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM11AIU */
#define IFX_MTU_MEMSTAT0_MEM11AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM11AIU */
#define IFX_MTU_MEMSTAT0_MEM11AIU_OFF (11)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM12AIU */
#define IFX_MTU_MEMSTAT0_MEM12AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM12AIU */
#define IFX_MTU_MEMSTAT0_MEM12AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM12AIU */
#define IFX_MTU_MEMSTAT0_MEM12AIU_OFF (12)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM13AIU */
#define IFX_MTU_MEMSTAT0_MEM13AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM13AIU */
#define IFX_MTU_MEMSTAT0_MEM13AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM13AIU */
#define IFX_MTU_MEMSTAT0_MEM13AIU_OFF (13)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM14AIU */
#define IFX_MTU_MEMSTAT0_MEM14AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM14AIU */
#define IFX_MTU_MEMSTAT0_MEM14AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM14AIU */
#define IFX_MTU_MEMSTAT0_MEM14AIU_OFF (14)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM15AIU */
#define IFX_MTU_MEMSTAT0_MEM15AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM15AIU */
#define IFX_MTU_MEMSTAT0_MEM15AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM15AIU */
#define IFX_MTU_MEMSTAT0_MEM15AIU_OFF (15)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM16AIU */
#define IFX_MTU_MEMSTAT0_MEM16AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM16AIU */
#define IFX_MTU_MEMSTAT0_MEM16AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM16AIU */
#define IFX_MTU_MEMSTAT0_MEM16AIU_OFF (16)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM17AIU */
#define IFX_MTU_MEMSTAT0_MEM17AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM17AIU */
#define IFX_MTU_MEMSTAT0_MEM17AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM17AIU */
#define IFX_MTU_MEMSTAT0_MEM17AIU_OFF (17)

