HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMtu_bf.h
/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM18AIU */
#define IFX_MTU_MEMSTAT0_MEM18AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM18AIU */
#define IFX_MTU_MEMSTAT0_MEM18AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM18AIU */
#define IFX_MTU_MEMSTAT0_MEM18AIU_OFF (18)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM19AIU */
#define IFX_MTU_MEMSTAT0_MEM19AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM19AIU */
#define IFX_MTU_MEMSTAT0_MEM19AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM19AIU */
#define IFX_MTU_MEMSTAT0_MEM19AIU_OFF (19)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM1AIU */
#define IFX_MTU_MEMSTAT0_MEM1AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM1AIU */
#define IFX_MTU_MEMSTAT0_MEM1AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM1AIU */
#define IFX_MTU_MEMSTAT0_MEM1AIU_OFF (1)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM20AIU */
#define IFX_MTU_MEMSTAT0_MEM20AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM20AIU */
#define IFX_MTU_MEMSTAT0_MEM20AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM20AIU */
#define IFX_MTU_MEMSTAT0_MEM20AIU_OFF (20)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM21AIU */
#define IFX_MTU_MEMSTAT0_MEM21AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM21AIU */
#define IFX_MTU_MEMSTAT0_MEM21AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM21AIU */
#define IFX_MTU_MEMSTAT0_MEM21AIU_OFF (21)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM22AIU */
#define IFX_MTU_MEMSTAT0_MEM22AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM22AIU */
#define IFX_MTU_MEMSTAT0_MEM22AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM22AIU */
#define IFX_MTU_MEMSTAT0_MEM22AIU_OFF (22)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM23AIU */
#define IFX_MTU_MEMSTAT0_MEM23AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM23AIU */
#define IFX_MTU_MEMSTAT0_MEM23AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM23AIU */
#define IFX_MTU_MEMSTAT0_MEM23AIU_OFF (23)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM24AIU */
#define IFX_MTU_MEMSTAT0_MEM24AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM24AIU */
#define IFX_MTU_MEMSTAT0_MEM24AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM24AIU */
#define IFX_MTU_MEMSTAT0_MEM24AIU_OFF (24)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM25AIU */
#define IFX_MTU_MEMSTAT0_MEM25AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM25AIU */
#define IFX_MTU_MEMSTAT0_MEM25AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM25AIU */
#define IFX_MTU_MEMSTAT0_MEM25AIU_OFF (25)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM26AIU */
#define IFX_MTU_MEMSTAT0_MEM26AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM26AIU */
#define IFX_MTU_MEMSTAT0_MEM26AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM26AIU */
#define IFX_MTU_MEMSTAT0_MEM26AIU_OFF (26)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM27AIU */
#define IFX_MTU_MEMSTAT0_MEM27AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM27AIU */
#define IFX_MTU_MEMSTAT0_MEM27AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM27AIU */
#define IFX_MTU_MEMSTAT0_MEM27AIU_OFF (27)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM28AIU */
#define IFX_MTU_MEMSTAT0_MEM28AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM28AIU */
#define IFX_MTU_MEMSTAT0_MEM28AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM28AIU */
#define IFX_MTU_MEMSTAT0_MEM28AIU_OFF (28)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM29AIU */
#define IFX_MTU_MEMSTAT0_MEM29AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM29AIU */
#define IFX_MTU_MEMSTAT0_MEM29AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM29AIU */
#define IFX_MTU_MEMSTAT0_MEM29AIU_OFF (29)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM2AIU */
#define IFX_MTU_MEMSTAT0_MEM2AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM2AIU */
#define IFX_MTU_MEMSTAT0_MEM2AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM2AIU */
#define IFX_MTU_MEMSTAT0_MEM2AIU_OFF (2)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM30AIU */
#define IFX_MTU_MEMSTAT0_MEM30AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM30AIU */
#define IFX_MTU_MEMSTAT0_MEM30AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM30AIU */
#define IFX_MTU_MEMSTAT0_MEM30AIU_OFF (30)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM31AIU */
#define IFX_MTU_MEMSTAT0_MEM31AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM31AIU */
#define IFX_MTU_MEMSTAT0_MEM31AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM31AIU */
#define IFX_MTU_MEMSTAT0_MEM31AIU_OFF (31)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM3AIU */
#define IFX_MTU_MEMSTAT0_MEM3AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM3AIU */
#define IFX_MTU_MEMSTAT0_MEM3AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM3AIU */
#define IFX_MTU_MEMSTAT0_MEM3AIU_OFF (3)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM4AIU */
#define IFX_MTU_MEMSTAT0_MEM4AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM4AIU */
#define IFX_MTU_MEMSTAT0_MEM4AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM4AIU */
#define IFX_MTU_MEMSTAT0_MEM4AIU_OFF (4)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM5AIU */
#define IFX_MTU_MEMSTAT0_MEM5AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM5AIU */
#define IFX_MTU_MEMSTAT0_MEM5AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM5AIU */
#define IFX_MTU_MEMSTAT0_MEM5AIU_OFF (5)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM6AIU */
#define IFX_MTU_MEMSTAT0_MEM6AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM6AIU */
#define IFX_MTU_MEMSTAT0_MEM6AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM6AIU */
#define IFX_MTU_MEMSTAT0_MEM6AIU_OFF (6)

