HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMtu_bf.h
/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM7AIU */
#define IFX_MTU_MEMSTAT0_MEM7AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM7AIU */
#define IFX_MTU_MEMSTAT0_MEM7AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM7AIU */
#define IFX_MTU_MEMSTAT0_MEM7AIU_OFF (7)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM8AIU */
#define IFX_MTU_MEMSTAT0_MEM8AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM8AIU */
#define IFX_MTU_MEMSTAT0_MEM8AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM8AIU */
#define IFX_MTU_MEMSTAT0_MEM8AIU_OFF (8)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.MEM9AIU */
#define IFX_MTU_MEMSTAT0_MEM9AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.MEM9AIU */
#define IFX_MTU_MEMSTAT0_MEM9AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.MEM9AIU */
#define IFX_MTU_MEMSTAT0_MEM9AIU_OFF (9)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM32AIU */
#define IFX_MTU_MEMSTAT1_MEM32AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM32AIU */
#define IFX_MTU_MEMSTAT1_MEM32AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM32AIU */
#define IFX_MTU_MEMSTAT1_MEM32AIU_OFF (32)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM33AIU */
#define IFX_MTU_MEMSTAT1_MEM33AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM33AIU */
#define IFX_MTU_MEMSTAT1_MEM33AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM33AIU */
#define IFX_MTU_MEMSTAT1_MEM33AIU_OFF (33)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM34AIU */
#define IFX_MTU_MEMSTAT1_MEM34AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM34AIU */
#define IFX_MTU_MEMSTAT1_MEM34AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM34AIU */
#define IFX_MTU_MEMSTAT1_MEM34AIU_OFF (34)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM35AIU */
#define IFX_MTU_MEMSTAT1_MEM35AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM35AIU */
#define IFX_MTU_MEMSTAT1_MEM35AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM35AIU */
#define IFX_MTU_MEMSTAT1_MEM35AIU_OFF (35)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM36AIU */
#define IFX_MTU_MEMSTAT1_MEM36AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM36AIU */
#define IFX_MTU_MEMSTAT1_MEM36AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM36AIU */
#define IFX_MTU_MEMSTAT1_MEM36AIU_OFF (36)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM37AIU */
#define IFX_MTU_MEMSTAT1_MEM37AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM37AIU */
#define IFX_MTU_MEMSTAT1_MEM37AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM37AIU */
#define IFX_MTU_MEMSTAT1_MEM37AIU_OFF (37)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM38AIU */
#define IFX_MTU_MEMSTAT1_MEM38AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM38AIU */
#define IFX_MTU_MEMSTAT1_MEM38AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM38AIU */
#define IFX_MTU_MEMSTAT1_MEM38AIU_OFF (38)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM39AIU */
#define IFX_MTU_MEMSTAT1_MEM39AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM39AIU */
#define IFX_MTU_MEMSTAT1_MEM39AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM39AIU */
#define IFX_MTU_MEMSTAT1_MEM39AIU_OFF (39)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM40AIU */
#define IFX_MTU_MEMSTAT1_MEM40AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM40AIU */
#define IFX_MTU_MEMSTAT1_MEM40AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM40AIU */
#define IFX_MTU_MEMSTAT1_MEM40AIU_OFF (40)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM41AIU */
#define IFX_MTU_MEMSTAT1_MEM41AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM41AIU */
#define IFX_MTU_MEMSTAT1_MEM41AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM41AIU */
#define IFX_MTU_MEMSTAT1_MEM41AIU_OFF (41)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM42AIU */
#define IFX_MTU_MEMSTAT1_MEM42AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM42AIU */
#define IFX_MTU_MEMSTAT1_MEM42AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM42AIU */
#define IFX_MTU_MEMSTAT1_MEM42AIU_OFF (42)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM43AIU */
#define IFX_MTU_MEMSTAT1_MEM43AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM43AIU */
#define IFX_MTU_MEMSTAT1_MEM43AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM43AIU */
#define IFX_MTU_MEMSTAT1_MEM43AIU_OFF (43)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM44AIU */
#define IFX_MTU_MEMSTAT1_MEM44AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM44AIU */
#define IFX_MTU_MEMSTAT1_MEM44AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM44AIU */
#define IFX_MTU_MEMSTAT1_MEM44AIU_OFF (44)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM45AIU */
#define IFX_MTU_MEMSTAT1_MEM45AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM45AIU */
#define IFX_MTU_MEMSTAT1_MEM45AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM45AIU */
#define IFX_MTU_MEMSTAT1_MEM45AIU_OFF (45)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM46AIU */
#define IFX_MTU_MEMSTAT1_MEM46AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM46AIU */
#define IFX_MTU_MEMSTAT1_MEM46AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM46AIU */
#define IFX_MTU_MEMSTAT1_MEM46AIU_OFF (46)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM47AIU */
#define IFX_MTU_MEMSTAT1_MEM47AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM47AIU */
#define IFX_MTU_MEMSTAT1_MEM47AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM47AIU */
#define IFX_MTU_MEMSTAT1_MEM47AIU_OFF (47)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM48AIU */
#define IFX_MTU_MEMSTAT1_MEM48AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM48AIU */
#define IFX_MTU_MEMSTAT1_MEM48AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM48AIU */
#define IFX_MTU_MEMSTAT1_MEM48AIU_OFF (48)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM49AIU */
#define IFX_MTU_MEMSTAT1_MEM49AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM49AIU */
#define IFX_MTU_MEMSTAT1_MEM49AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM49AIU */
#define IFX_MTU_MEMSTAT1_MEM49AIU_OFF (49)

