HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMtu_bf.h
/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM50AIU */
#define IFX_MTU_MEMSTAT1_MEM50AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM50AIU */
#define IFX_MTU_MEMSTAT1_MEM50AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM50AIU */
#define IFX_MTU_MEMSTAT1_MEM50AIU_OFF (50)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM51AIU */
#define IFX_MTU_MEMSTAT1_MEM51AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM51AIU */
#define IFX_MTU_MEMSTAT1_MEM51AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM51AIU */
#define IFX_MTU_MEMSTAT1_MEM51AIU_OFF (51)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM52AIU */
#define IFX_MTU_MEMSTAT1_MEM52AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM52AIU */
#define IFX_MTU_MEMSTAT1_MEM52AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM52AIU */
#define IFX_MTU_MEMSTAT1_MEM52AIU_OFF (52)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM53AIU */
#define IFX_MTU_MEMSTAT1_MEM53AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM53AIU */
#define IFX_MTU_MEMSTAT1_MEM53AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM53AIU */
#define IFX_MTU_MEMSTAT1_MEM53AIU_OFF (53)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM54AIU */
#define IFX_MTU_MEMSTAT1_MEM54AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM54AIU */
#define IFX_MTU_MEMSTAT1_MEM54AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM54AIU */
#define IFX_MTU_MEMSTAT1_MEM54AIU_OFF (54)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM55AIU */
#define IFX_MTU_MEMSTAT1_MEM55AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM55AIU */
#define IFX_MTU_MEMSTAT1_MEM55AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM55AIU */
#define IFX_MTU_MEMSTAT1_MEM55AIU_OFF (55)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM56AIU */
#define IFX_MTU_MEMSTAT1_MEM56AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM56AIU */
#define IFX_MTU_MEMSTAT1_MEM56AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM56AIU */
#define IFX_MTU_MEMSTAT1_MEM56AIU_OFF (56)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM57AIU */
#define IFX_MTU_MEMSTAT1_MEM57AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM57AIU */
#define IFX_MTU_MEMSTAT1_MEM57AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM57AIU */
#define IFX_MTU_MEMSTAT1_MEM57AIU_OFF (57)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM58AIU */
#define IFX_MTU_MEMSTAT1_MEM58AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM58AIU */
#define IFX_MTU_MEMSTAT1_MEM58AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM58AIU */
#define IFX_MTU_MEMSTAT1_MEM58AIU_OFF (58)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM59AIU */
#define IFX_MTU_MEMSTAT1_MEM59AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM59AIU */
#define IFX_MTU_MEMSTAT1_MEM59AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM59AIU */
#define IFX_MTU_MEMSTAT1_MEM59AIU_OFF (59)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM60AIU */
#define IFX_MTU_MEMSTAT1_MEM60AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM60AIU */
#define IFX_MTU_MEMSTAT1_MEM60AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM60AIU */
#define IFX_MTU_MEMSTAT1_MEM60AIU_OFF (60)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM61AIU */
#define IFX_MTU_MEMSTAT1_MEM61AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM61AIU */
#define IFX_MTU_MEMSTAT1_MEM61AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM61AIU */
#define IFX_MTU_MEMSTAT1_MEM61AIU_OFF (61)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM62AIU */
#define IFX_MTU_MEMSTAT1_MEM62AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM62AIU */
#define IFX_MTU_MEMSTAT1_MEM62AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM62AIU */
#define IFX_MTU_MEMSTAT1_MEM62AIU_OFF (62)

/** \\brief  Length for Ifx_MTU_MEMSTAT1_Bits.MEM63AIU */
#define IFX_MTU_MEMSTAT1_MEM63AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT1_Bits.MEM63AIU */
#define IFX_MTU_MEMSTAT1_MEM63AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT1_Bits.MEM63AIU */
#define IFX_MTU_MEMSTAT1_MEM63AIU_OFF (63)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM64AIU */
#define IFX_MTU_MEMSTAT2_MEM64AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM64AIU */
#define IFX_MTU_MEMSTAT2_MEM64AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM64AIU */
#define IFX_MTU_MEMSTAT2_MEM64AIU_OFF (64)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM65AIU */
#define IFX_MTU_MEMSTAT2_MEM65AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM65AIU */
#define IFX_MTU_MEMSTAT2_MEM65AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM65AIU */
#define IFX_MTU_MEMSTAT2_MEM65AIU_OFF (65)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM66AIU */
#define IFX_MTU_MEMSTAT2_MEM66AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM66AIU */
#define IFX_MTU_MEMSTAT2_MEM66AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM66AIU */
#define IFX_MTU_MEMSTAT2_MEM66AIU_OFF (66)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM67AIU */
#define IFX_MTU_MEMSTAT2_MEM67AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM67AIU */
#define IFX_MTU_MEMSTAT2_MEM67AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM67AIU */
#define IFX_MTU_MEMSTAT2_MEM67AIU_OFF (67)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM68AIU */
#define IFX_MTU_MEMSTAT2_MEM68AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM68AIU */
#define IFX_MTU_MEMSTAT2_MEM68AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM68AIU */
#define IFX_MTU_MEMSTAT2_MEM68AIU_OFF (68)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM69AIU */
#define IFX_MTU_MEMSTAT2_MEM69AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM69AIU */
#define IFX_MTU_MEMSTAT2_MEM69AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM69AIU */
#define IFX_MTU_MEMSTAT2_MEM69AIU_OFF (69)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM70AIU */
#define IFX_MTU_MEMSTAT2_MEM70AIU_LEN (0)

