HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMtu_bf.h
/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM70AIU */
#define IFX_MTU_MEMSTAT2_MEM70AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM70AIU */
#define IFX_MTU_MEMSTAT2_MEM70AIU_OFF (70)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM71AIU */
#define IFX_MTU_MEMSTAT2_MEM71AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM71AIU */
#define IFX_MTU_MEMSTAT2_MEM71AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM71AIU */
#define IFX_MTU_MEMSTAT2_MEM71AIU_OFF (71)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM72AIU */
#define IFX_MTU_MEMSTAT2_MEM72AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM72AIU */
#define IFX_MTU_MEMSTAT2_MEM72AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM72AIU */
#define IFX_MTU_MEMSTAT2_MEM72AIU_OFF (72)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM73AIU */
#define IFX_MTU_MEMSTAT2_MEM73AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM73AIU */
#define IFX_MTU_MEMSTAT2_MEM73AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM73AIU */
#define IFX_MTU_MEMSTAT2_MEM73AIU_OFF (73)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM74AIU */
#define IFX_MTU_MEMSTAT2_MEM74AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM74AIU */
#define IFX_MTU_MEMSTAT2_MEM74AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM74AIU */
#define IFX_MTU_MEMSTAT2_MEM74AIU_OFF (74)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM75AIU */
#define IFX_MTU_MEMSTAT2_MEM75AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM75AIU */
#define IFX_MTU_MEMSTAT2_MEM75AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM75AIU */
#define IFX_MTU_MEMSTAT2_MEM75AIU_OFF (75)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM76AIU */
#define IFX_MTU_MEMSTAT2_MEM76AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM76AIU */
#define IFX_MTU_MEMSTAT2_MEM76AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM76AIU */
#define IFX_MTU_MEMSTAT2_MEM76AIU_OFF (76)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM77AIU */
#define IFX_MTU_MEMSTAT2_MEM77AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM77AIU */
#define IFX_MTU_MEMSTAT2_MEM77AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM77AIU */
#define IFX_MTU_MEMSTAT2_MEM77AIU_OFF (77)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM78AIU */
#define IFX_MTU_MEMSTAT2_MEM78AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM78AIU */
#define IFX_MTU_MEMSTAT2_MEM78AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM78AIU */
#define IFX_MTU_MEMSTAT2_MEM78AIU_OFF (78)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM79AIU */
#define IFX_MTU_MEMSTAT2_MEM79AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM79AIU */
#define IFX_MTU_MEMSTAT2_MEM79AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM79AIU */
#define IFX_MTU_MEMSTAT2_MEM79AIU_OFF (79)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM80AIU */
#define IFX_MTU_MEMSTAT2_MEM80AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM80AIU */
#define IFX_MTU_MEMSTAT2_MEM80AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM80AIU */
#define IFX_MTU_MEMSTAT2_MEM80AIU_OFF (80)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM81AIU */
#define IFX_MTU_MEMSTAT2_MEM81AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM81AIU */
#define IFX_MTU_MEMSTAT2_MEM81AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM81AIU */
#define IFX_MTU_MEMSTAT2_MEM81AIU_OFF (81)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM82AIU */
#define IFX_MTU_MEMSTAT2_MEM82AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM82AIU */
#define IFX_MTU_MEMSTAT2_MEM82AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM82AIU */
#define IFX_MTU_MEMSTAT2_MEM82AIU_OFF (82)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM83AIU */
#define IFX_MTU_MEMSTAT2_MEM83AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM83AIU */
#define IFX_MTU_MEMSTAT2_MEM83AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM83AIU */
#define IFX_MTU_MEMSTAT2_MEM83AIU_OFF (83)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM84AIU */
#define IFX_MTU_MEMSTAT2_MEM84AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM84AIU */
#define IFX_MTU_MEMSTAT2_MEM84AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM84AIU */
#define IFX_MTU_MEMSTAT2_MEM84AIU_OFF (84)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM85AIU */
#define IFX_MTU_MEMSTAT2_MEM85AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM85AIU */
#define IFX_MTU_MEMSTAT2_MEM85AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM85AIU */
#define IFX_MTU_MEMSTAT2_MEM85AIU_OFF (85)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM86AIU */
#define IFX_MTU_MEMSTAT2_MEM86AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM86AIU */
#define IFX_MTU_MEMSTAT2_MEM86AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM86AIU */
#define IFX_MTU_MEMSTAT2_MEM86AIU_OFF (86)

/** \\brief  Length for Ifx_MTU_MEMSTAT2_Bits.MEM87AIU */
#define IFX_MTU_MEMSTAT2_MEM87AIU_LEN (0)

/** \\brief  Mask for Ifx_MTU_MEMSTAT2_Bits.MEM87AIU */
#define IFX_MTU_MEMSTAT2_MEM87AIU_MSK (0x0)

/** \\brief  Offset for Ifx_MTU_MEMSTAT2_Bits.MEM87AIU */
#define IFX_MTU_MEMSTAT2_MEM87AIU_OFF (87)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0DSEN */
#define IFX_MTU_MEMTEST0_CPU0DSEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0DSEN */
#define IFX_MTU_MEMTEST0_CPU0DSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0DSEN */
#define IFX_MTU_MEMTEST0_CPU0DSEN_OFF (14)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0PCEN */
#define IFX_MTU_MEMTEST0_CPU0PCEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0PCEN */
#define IFX_MTU_MEMTEST0_CPU0PCEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0PCEN */
#define IFX_MTU_MEMTEST0_CPU0PCEN_OFF (15)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0PSEN */
#define IFX_MTU_MEMTEST0_CPU0PSEN_LEN (1)

