HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMtu_bf.h
/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0PSEN */
#define IFX_MTU_MEMTEST0_CPU0PSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0PSEN */
#define IFX_MTU_MEMTEST0_CPU0PSEN_OFF (16)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0PTEN */
#define IFX_MTU_MEMTEST0_CPU0PTEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0PTEN */
#define IFX_MTU_MEMTEST0_CPU0PTEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0PTEN */
#define IFX_MTU_MEMTEST0_CPU0PTEN_OFF (17)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1DCEN */
#define IFX_MTU_MEMTEST0_CPU1DCEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1DCEN */
#define IFX_MTU_MEMTEST0_CPU1DCEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1DCEN */
#define IFX_MTU_MEMTEST0_CPU1DCEN_OFF (7)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1DSEN */
#define IFX_MTU_MEMTEST0_CPU1DSEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1DSEN */
#define IFX_MTU_MEMTEST0_CPU1DSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1DSEN */
#define IFX_MTU_MEMTEST0_CPU1DSEN_OFF (6)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1DTEN */
#define IFX_MTU_MEMTEST0_CPU1DTEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1DTEN */
#define IFX_MTU_MEMTEST0_CPU1DTEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1DTEN */
#define IFX_MTU_MEMTEST0_CPU1DTEN_OFF (8)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1PCEN */
#define IFX_MTU_MEMTEST0_CPU1PCEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1PCEN */
#define IFX_MTU_MEMTEST0_CPU1PCEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1PCEN */
#define IFX_MTU_MEMTEST0_CPU1PCEN_OFF (10)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1PSEN */
#define IFX_MTU_MEMTEST0_CPU1PSEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1PSEN */
#define IFX_MTU_MEMTEST0_CPU1PSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1PSEN */
#define IFX_MTU_MEMTEST0_CPU1PSEN_OFF (9)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1PTEN */
#define IFX_MTU_MEMTEST0_CPU1PTEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1PTEN */
#define IFX_MTU_MEMTEST0_CPU1PTEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1PTEN */
#define IFX_MTU_MEMTEST0_CPU1PTEN_OFF (11)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU2DCEN */
#define IFX_MTU_MEMTEST0_CPU2DCEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU2DCEN */
#define IFX_MTU_MEMTEST0_CPU2DCEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU2DCEN */
#define IFX_MTU_MEMTEST0_CPU2DCEN_OFF (1)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU2DSEN */
#define IFX_MTU_MEMTEST0_CPU2DSEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU2DSEN */
#define IFX_MTU_MEMTEST0_CPU2DSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU2DSEN */
#define IFX_MTU_MEMTEST0_CPU2DSEN_OFF (0)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU2DTEN */
#define IFX_MTU_MEMTEST0_CPU2DTEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU2DTEN */
#define IFX_MTU_MEMTEST0_CPU2DTEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU2DTEN */
#define IFX_MTU_MEMTEST0_CPU2DTEN_OFF (2)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU2PCEN */
#define IFX_MTU_MEMTEST0_CPU2PCEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU2PCEN */
#define IFX_MTU_MEMTEST0_CPU2PCEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU2PCEN */
#define IFX_MTU_MEMTEST0_CPU2PCEN_OFF (4)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU2PSEN */
#define IFX_MTU_MEMTEST0_CPU2PSEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU2PSEN */
#define IFX_MTU_MEMTEST0_CPU2PSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU2PSEN */
#define IFX_MTU_MEMTEST0_CPU2PSEN_OFF (3)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU2PTEN */
#define IFX_MTU_MEMTEST0_CPU2PTEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU2PTEN */
#define IFX_MTU_MEMTEST0_CPU2PTEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU2PTEN */
#define IFX_MTU_MEMTEST0_CPU2PTEN_OFF (5)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.ETHEN */
#define IFX_MTU_MEMTEST0_ETHEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.ETHEN */
#define IFX_MTU_MEMTEST0_ETHEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.ETHEN */
#define IFX_MTU_MEMTEST0_ETHEN_OFF (22)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.FSI0EN */
#define IFX_MTU_MEMTEST0_FSI0EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.FSI0EN */
#define IFX_MTU_MEMTEST0_FSI0EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.FSI0EN */
#define IFX_MTU_MEMTEST0_FSI0EN_OFF (26)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.GTM1AEN */
#define IFX_MTU_MEMTEST0_GTM1AEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTM1AEN */
#define IFX_MTU_MEMTEST0_GTM1AEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTM1AEN */
#define IFX_MTU_MEMTEST0_GTM1AEN_OFF (31)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.GTMFEN */
#define IFX_MTU_MEMTEST0_GTMFEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTMFEN */
#define IFX_MTU_MEMTEST0_GTMFEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTMFEN */
#define IFX_MTU_MEMTEST0_GTMFEN_OFF (28)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.GTMM0EN */
#define IFX_MTU_MEMTEST0_GTMM0EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTMM0EN */
#define IFX_MTU_MEMTEST0_GTMM0EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTMM0EN */
#define IFX_MTU_MEMTEST0_GTMM0EN_OFF (29)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.GTMM1EN */
#define IFX_MTU_MEMTEST0_GTMM1EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTMM1EN */
#define IFX_MTU_MEMTEST0_GTMM1EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTMM1EN */
#define IFX_MTU_MEMTEST0_GTMM1EN_OFF (30)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.HSMCEN */
#define IFX_MTU_MEMTEST0_HSMCEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.HSMCEN */
#define IFX_MTU_MEMTEST0_HSMCEN_MSK (0x1)

