HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMtu_bf.h
/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.HSMCEN */
#define IFX_MTU_MEMTEST0_HSMCEN_OFF (23)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.HSMREN */
#define IFX_MTU_MEMTEST0_HSMREN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.HSMREN */
#define IFX_MTU_MEMTEST0_HSMREN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.HSMREN */
#define IFX_MTU_MEMTEST0_HSMREN_OFF (25)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.HSMTEN */
#define IFX_MTU_MEMTEST0_HSMTEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.HSMTEN */
#define IFX_MTU_MEMTEST0_HSMTEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.HSMTEN */
#define IFX_MTU_MEMTEST0_HSMTEN_OFF (24)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.BMUEN */
#define IFX_MTU_MEMTEST1_BMUEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.BMUEN */
#define IFX_MTU_MEMTEST1_BMUEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.BMUEN */
#define IFX_MTU_MEMTEST1_BMUEN_OFF (3)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML0EN */
#define IFX_MTU_MEMTEST1_EMEML0EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML0EN */
#define IFX_MTU_MEMTEST1_EMEML0EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML0EN */
#define IFX_MTU_MEMTEST1_EMEML0EN_OFF (14)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML10EN */
#define IFX_MTU_MEMTEST1_EMEML10EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML10EN */
#define IFX_MTU_MEMTEST1_EMEML10EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML10EN */
#define IFX_MTU_MEMTEST1_EMEML10EN_OFF (24)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML11EN */
#define IFX_MTU_MEMTEST1_EMEML11EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML11EN */
#define IFX_MTU_MEMTEST1_EMEML11EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML11EN */
#define IFX_MTU_MEMTEST1_EMEML11EN_OFF (25)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML12EN */
#define IFX_MTU_MEMTEST1_EMEML12EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML12EN */
#define IFX_MTU_MEMTEST1_EMEML12EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML12EN */
#define IFX_MTU_MEMTEST1_EMEML12EN_OFF (26)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML13EN */
#define IFX_MTU_MEMTEST1_EMEML13EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML13EN */
#define IFX_MTU_MEMTEST1_EMEML13EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML13EN */
#define IFX_MTU_MEMTEST1_EMEML13EN_OFF (27)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML14EN */
#define IFX_MTU_MEMTEST1_EMEML14EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML14EN */
#define IFX_MTU_MEMTEST1_EMEML14EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML14EN */
#define IFX_MTU_MEMTEST1_EMEML14EN_OFF (28)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML15EN */
#define IFX_MTU_MEMTEST1_EMEML15EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML15EN */
#define IFX_MTU_MEMTEST1_EMEML15EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML15EN */
#define IFX_MTU_MEMTEST1_EMEML15EN_OFF (29)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML1EN */
#define IFX_MTU_MEMTEST1_EMEML1EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML1EN */
#define IFX_MTU_MEMTEST1_EMEML1EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML1EN */
#define IFX_MTU_MEMTEST1_EMEML1EN_OFF (15)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML2EN */
#define IFX_MTU_MEMTEST1_EMEML2EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML2EN */
#define IFX_MTU_MEMTEST1_EMEML2EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML2EN */
#define IFX_MTU_MEMTEST1_EMEML2EN_OFF (16)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML3EN */
#define IFX_MTU_MEMTEST1_EMEML3EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML3EN */
#define IFX_MTU_MEMTEST1_EMEML3EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML3EN */
#define IFX_MTU_MEMTEST1_EMEML3EN_OFF (17)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML4EN */
#define IFX_MTU_MEMTEST1_EMEML4EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML4EN */
#define IFX_MTU_MEMTEST1_EMEML4EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML4EN */
#define IFX_MTU_MEMTEST1_EMEML4EN_OFF (18)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML5EN */
#define IFX_MTU_MEMTEST1_EMEML5EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML5EN */
#define IFX_MTU_MEMTEST1_EMEML5EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML5EN */
#define IFX_MTU_MEMTEST1_EMEML5EN_OFF (19)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML6EN */
#define IFX_MTU_MEMTEST1_EMEML6EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML6EN */
#define IFX_MTU_MEMTEST1_EMEML6EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML6EN */
#define IFX_MTU_MEMTEST1_EMEML6EN_OFF (20)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML7EN */
#define IFX_MTU_MEMTEST1_EMEML7EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML7EN */
#define IFX_MTU_MEMTEST1_EMEML7EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML7EN */
#define IFX_MTU_MEMTEST1_EMEML7EN_OFF (21)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML8EN */
#define IFX_MTU_MEMTEST1_EMEML8EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML8EN */
#define IFX_MTU_MEMTEST1_EMEML8EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML8EN */
#define IFX_MTU_MEMTEST1_EMEML8EN_OFF (22)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML9EN */
#define IFX_MTU_MEMTEST1_EMEML9EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML9EN */
#define IFX_MTU_MEMTEST1_EMEML9EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML9EN */
#define IFX_MTU_MEMTEST1_EMEML9EN_OFF (23)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.ERAY0MEN */
#define IFX_MTU_MEMTEST1_ERAY0MEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.ERAY0MEN */
#define IFX_MTU_MEMTEST1_ERAY0MEN_MSK (0x1)

